/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   test.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sanglee2 <sanglee2@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/03/02 10:16:46 by sanglee2          #+#    #+#             */
/*   Updated: 2023/03/14 16:05:09 by sanglee2         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// 매크로 define 연습


// greedy 알고리즘 테스트

#include <stdio.h>

int main()
{
	int n;
	int count;
	int coinTypes[4];

	n = 0;
	count = 0; 
	coinTypes[4] = 


}
